; domain
(define (domain delivery)
  (:requirements :strips :typing)

  (:types
    agent package location - object
  )

  (:predicates
    (at ?a - agent ?l - location)
    (has ?a - agent ?p - package)
    (in ?p - package ?l - location)
    (connected ?from - location ?to - location)
    (requested ?p - package ?dest - location)
    (delivered ?p - package)
    (available ?a - agent)
  )

  (:action pick-up
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (at ?a ?l) (in ?p ?l) (available ?a))
    :effect (and 
              (has ?a ?p)
              (not (in ?p ?l))
            )
  )

  (:action move
    :parameters (?a - agent ?from - location ?to - location)
    :precondition (and (at ?a ?from) (connected ?from ?to) (available ?a))
    :effect (and 
              (at ?a ?to)
              (not (at ?a ?from)))
  )

  (:action drop-off
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (has ?a ?p) (at ?a ?l) (requested ?p ?l))
    :effect (and 
              (delivered ?p)
              (in ?p ?l)
              (not (has ?a ?p)))
            )
  )

; problem
(define (problem delivery-competition)
(:domain delivery)
(:objects
  courier1 courier2 - agent
  urgentPkg normalPkg - package
  warehouse station client - location
)
(:init
  (at courier1 warehouse)(at courier2 station)
  (in urgentPkg warehouse)(in normalPkg station)
  (connected warehouse client)(connected station client)
  (requested urgentPkg client)(requested normalPkg client)
  (available courier1)(available courier2)
)
(:goal (and (delivered urgentPkg)(delivered normalPkg))))

; plan
1. (pick-up courier1 urgentpkg warehouse)
   deleted: (in urgentpkg warehouse)
   added: (has courier1 urgentpkg)
   goals met: 0 of 2
2. (move courier1 warehouse client)
   deleted: (at courier1 warehouse)
   added: (at courier1 client)
   goals met: 0 of 2
3. (drop-off courier1 urgentpkg client)
   deleted: (has courier1 urgentpkg)
   added: (delivered urgentpkg) (in urgentpkg client)
   goals met: 1 of 2
4. (pick-up courier2 normalpkg station)
   deleted: (in normalpkg station)
   added: (has courier2 normalpkg)
   goals met: 1 of 2
5. (move courier2 station client)
   deleted: (at courier2 station)
   added: (at courier2 client)
   goals met: 1 of 2
6. (drop-off courier2 normalpkg client)
   deleted: (has courier2 normalpkg)
   added: (delivered normalpkg) (in normalpkg client)
   goals met: 2 of 2
